КАКерамика_моя_старая_база.QW_ОграничениеДоступа/src/InformationRegisters/Ассортимент/Ассортимент.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="0a31d50e-b19b-40a9-8ffd-9699c8120070">
  <name>Ассортимент</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources extendedConfigurationObject="97f5df5b-1411-4bf9-a504-ce020e1e532a">
    <name>РазрешеныПродажи</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="0d8e8fa9-4001-46aa-940d-14d1d2320de8">
    <name>РольАссортимента</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="b87d309e-0f04-4549-ba1f-582854ffc4e0">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

КАКерамика_моя_старая_база.QW_ОграничениеДоступа/src/AccumulationRegisters/СвободныеОстатки/СвободныеОстатки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="d2b56f80-9fb3-4256-ac70-94db57b20403">
  <name>СвободныеОстатки</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="13baab32-7323-4955-9670-6e6d591ac27e">
    <name>ВНаличии</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="190d8b4e-655e-4cda-9e59-ed474013adb4">
    <name>ВРезервеСоСклада</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="fdb0591b-9229-4e19-a90c-ec26852f3f57">
    <name>ВРезервеПодЗаказ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="61bd9a07-a5cf-44a6-8782-269a97817edc">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

КАКерамика_моя_старая_база.QW_ОграничениеДоступа/src/Enums/ЭтапыИзмененияАссортимента/ЭтапыИзмененияАссортимента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="2f35f70b-f695-47b5-907b-3b6f88a80bc2">
  <name>ЭтапыИзмененияАссортимента</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="00ccca3d-008a-4259-b525-1a9ffc8346e1">
    <name>ВводВАссортимент</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="4c1c00db-b1db-46dd-ad76-67a936cf4e37">
    <name>ВводВАссортиментСОтсрочкойНачалаПродаж</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="0cbadffb-3264-4e65-a60e-808afd04979b">
    <name>ИзменениеСостоянияАссортимента</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="9809f95b-2d6d-4c85-8c1c-85dcb9cc326d">
    <name>ВыводИзАссортимента</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="43013b47-f194-4afa-88a7-10cbbb453b77">
    <name>ПереносВАрхивОтзыв</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база.QW_ОграничениеДоступа/src/Enums/РолиАссортимента/РолиАссортимента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="49bd7895-0477-4e6d-9237-25c4a2944fc1">
  <name>РолиАссортимента</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="c977ea13-d958-44ab-9208-1112c53fc2db">
    <name>ПостоянныйАссортимент</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="8cc180ee-4c2d-4019-9a57-6fd5b89704f7">
    <name>ДополнительныйАссортимент</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="cbca0cc1-eed4-462f-88ed-bc51075a8823">
    <name>ПробныйАссортимент</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база.QW_ОграничениеДоступа/src/CommonModules/ОД_ОбщиеФункции/Module.bsl
Функция ПолучитьВесОбъем(п_Номенклатура) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(ВложенныйЗапрос.Вес) КАК Вес,
		|	СУММА(ВложенныйЗапрос.Объем) КАК Объем
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВЫРАЗИТЬ(ДР.Значение КАК ЧИСЛО) КАК Вес,
		|		0 КАК Объем
		|	ИЗ
		|		Справочник.Номенклатура.ДополнительныеРеквизиты КАК ДР
		|	ГДЕ
		|		ДР.Ссылка = &Ссылка
		|		И ДР.Свойство = &Свойство1
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ
		|		0,
		|		ВЫРАЗИТЬ(ДР.Значение КАК ЧИСЛО)
		|	ИЗ
		|		Справочник.Номенклатура.ДополнительныеРеквизиты КАК ДР
		|	ГДЕ
		|		ДР.Ссылка = &Ссылка
		|		И ДР.Свойство = &Свойство2) КАК ВложенныйЗапрос";
	
	Запрос.УстановитьПараметр("Свойство1", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Вес Брутто", Истина));
	Запрос.УстановитьПараметр("Свойство2", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Объем", Истина));
	Запрос.УстановитьПараметр("Ссылка", п_Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Рез = Новый Структура();
	
	ТекВес = 0;
	ТекОбъем = 0;
	Если Выборка.Следующий() Тогда
		Если ЗначениеЗаполнено(Выборка.Вес) Тогда
			ТекВес = Выборка.Вес;
		КонецЕсли;
		Если ЗначениеЗаполнено(Выборка.Объем) Тогда
			ТекОбъем = Выборка.Объем
		КонецЕсли;
	КонецЕсли;

	Рез.Вставить("Вес",		ТекВес);
	Рез.Вставить("Объем",	ТекОбъем);
	
	Возврат Рез;

КонецФункции // ()

Функция ПолучитьВесОбъемДляСтроки(п_СтрокаТЧ) Экспорт
	
	ТекВес = 0;
	ТекОбъем = 0;
	ТекВесЕдиницы = 0;
	ТекОбъемЕдиницы = 0;

	ВесОбъемСтроки = ПолучитьВесОбъем(п_СтрокаТЧ.Номенклатура);
	
	Если ЗначениеЗаполнено(п_СтрокаТЧ.Количество) Тогда
		ТекВес 				= ВесОбъемСтроки.Вес * п_СтрокаТЧ.Количество;
		ТекВесЕдиницы		= ВесОбъемСтроки.Вес;
		ТекОбъем			= ВесОбъемСтроки.Объем * п_СтрокаТЧ.Количество;
		ТекОбъемЕдиницы		= ВесОбъемСтроки.Объем;
	КонецЕсли;

	Рез = Новый Структура();
	
	Рез.Вставить("Вес",				ТекВес);
	Рез.Вставить("Объем",			ТекОбъем);
	Рез.Вставить("ВесЕдиницы",		ТекВесЕдиницы);
	Рез.Вставить("ОбъемЕдиницы",	ТекОбъемЕдиницы);
	
	Возврат Рез;

КонецФункции // ()

Функция ПолучитьВесОбъемДляДокумента(п_Документ) Экспорт

	Если ТипЗнч(п_Документ) = Тип("ДокументСсылка.ЗаявкаНаВозвратТоваровОтКлиента") Тогда
		ТЧ = п_Документ.ВозвращаемыеТовары;
	Иначе
		ТЧ = п_Документ.Товары;
	КонецЕсли;	

	Рез = Новый Структура("Вес, Объем", 0, 0);
	Для каждого Т Из ТЧ Цикл
		ВесОбъем = ПолучитьВесОбъемДляСтроки(Т);
		Рез.Вес		= Рез.Вес + ВесОбъем.Вес;
		Рез.Объем	= Рез.Объем + ВесОбъем.Объем;
	КонецЦикла;
	
	Возврат Рез;
	
КонецФункции // ПолучитьВесОбъемДляДокумента()

Функция ОстатокТовараПоОрганизации(п_Номенклатура, п_ДатаОстатков, п_Организация = Неопределено) Экспорт

	Запрос = Новый Запрос;
	ЗапросТекст = 
		"ВЫБРАТЬ
		|	ТоварыОрганизацийОстатки.КоличествоОстаток КАК Количество
		|ИЗ
		|	РегистрНакопления.ТоварыОрганизаций.Остатки(
		|			&ДатаОстатков,
		|			АналитикаУчетаНоменклатуры.Номенклатура = &Номенклатура
		|				И Организация = &Организация) КАК ТоварыОрганизацийОстатки";
	
	Запрос.УстановитьПараметр("ДатаОстатков", п_ДатаОстатков);
	Запрос.УстановитьПараметр("Номенклатура", п_Номенклатура);
	
	Если п_Организация = Неопределено Тогда
		ЗапросТекст = СтрЗаменить(ЗапросТекст, "И Организация = &Организация", ""); 	
	Иначе	
		Запрос.УстановитьПараметр("Организация", п_Организация);
	КонецЕсли;
	
	Запрос.Текст = ЗапросТекст;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Количество;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции // ПолучитьВесОбъемДляДокумента()

Функция ОстатокКОформлению(п_Номенклатура, п_ДатаОстатков, п_ДокументОтгрузки) Экспорт

	Запрос = Новый Запрос;
	ЗапросТекст = 
		"ВЫБРАТЬ
		|	ТоварыКОтгрузкеОстатки.КОформлениюОстаток + ТоварыКОтгрузкеОстатки.ВРезервеОстаток КАК КОформлению
		|ИЗ
		|	РегистрНакопления.ТоварыКОтгрузке.Остатки(
		|			,
		|			ДокументОтгрузки = &ДокументОтгрузки
		|				И Номенклатура = &Номенклатура) КАК ТоварыКОтгрузкеОстатки";
	
	//Запрос.УстановитьПараметр("ДатаОстатков", п_ДатаОстатков);
	Запрос.УстановитьПараметр("Номенклатура", п_Номенклатура);
	Запрос.УстановитьПараметр("ДокументОтгрузки", п_ДокументОтгрузки);
	
	Запрос.Текст = ЗапросТекст;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.КОформлению;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции // ПолучитьВесОбъемДляДокумента()

// 20.07.2026
Функция УстановленЗапретОтгрузкиПоСегменту(п_Партнер, п_Соглашение) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПартнерыСегмента.Сегмент КАК Сегмент,
	               |	ПартнерыСегмента.Сегмент.ДатаСоздания КАК СегментДатаСоздания
	               |ИЗ
	               |	РегистрСведений.ПартнерыСегмента КАК ПартнерыСегмента
	               |ГДЕ
	               |	ПартнерыСегмента.Сегмент.ЗапретОтгрузки
	               |	И НЕ ПартнерыСегмента.Сегмент.ЭтоГруппа
	               |	И НЕ ПартнерыСегмента.Сегмент.ПометкаУдаления
	               |	И ПартнерыСегмента.Партнер = &Партнер";
	
	Запрос.УстановитьПараметр("Партнер", п_Партнер);
	
	Возврат НЕ Запрос.Выполнить().Пустой();

КонецФункции

#Область УправлениеАссортиментом

Функция АссортиментВыделитьЦветом(п_Номенклатура, п_Дата) Экспорт

	РольЭтап = РольЭтап(п_Номенклатура, п_Дата);
	
	Если ПустаяСтрока(РольЭтап.Этап) Тогда
		Возврат Ложь;
	КонецЕсли;

	Если РольЭтап.Этап = Перечисления.ЭтапыИзмененияАссортимента.ВводВАссортимент Тогда
		Если РольЭтап.Роль = Перечисления.РолиАссортимента.ДополнительныйАссортимент Тогда
			Возврат Истина;
		КонецЕсли;
	ИначеЕсли РольЭтап.Этап = Перечисления.ЭтапыИзмененияАссортимента.ИзменениеСостоянияАссортимента Тогда
		Если РольЭтап.Роль = Перечисления.РолиАссортимента.ДополнительныйАссортимент Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;

	Возврат Ложь;
	
КонецФункции // ()

Функция РольЭтап(п_Номенклатура, п_Дата)

	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	АссортиментСрезПоследних.Регистратор.Этап КАК Этап,
		|	АссортиментСрезПоследних.РольАссортимента КАК Роль
		|ИЗ
		|	РегистрСведений.Ассортимент.СрезПоследних(&Дата, Номенклатура = &Номенклатура) КАК АссортиментСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", п_Дата);
	Запрос.УстановитьПараметр("Номенклатура", п_Номенклатура);
	
	Рез = Новый Структура();
	Рез.Вставить("Роль", "");
	Рез.Вставить("Этап", "");
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Рез, Выборка);
	КонецЕсли;
	
	Возврат Рез;

КонецФункции // ()

Функция ОстатокТовара(п_МассивНоменклатуры, п_Дата)

	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СвободныеОстаткиОстатки.Номенклатура КАК Номенклатура,
		|	СвободныеОстаткиОстатки.ВНаличииОстаток - СвободныеОстаткиОстатки.ВРезервеСоСкладаОстаток - СвободныеОстаткиОстатки.ВРезервеПодЗаказОстаток КАК Остаток
		|ИЗ
		|	РегистрНакопления.СвободныеОстатки.Остатки(&Дата, Номенклатура В (&Номенклатура)) КАК СвободныеОстаткиОстатки";
	
	Запрос.УстановитьПараметр("Дата", п_Дата);
	Запрос.УстановитьПараметр("Номенклатура", п_МассивНоменклатуры);
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции // ()

// родной алгоритм
Процедура УправлениеАссортиментомРС(Отказ, ТекущийОбъект, ПараметрыЗаписи) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	АссортиментСрезПоследних.Регистратор.Этап КАК Этап,
		|	АссортиментСрезПоследних.Номенклатура КАК Номенклатура
		|ИЗ
		|	РегистрСведений.Ассортимент.СрезПоследних(&Дата, Номенклатура В (&Номенклатура)) КАК АссортиментСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", ТекущийОбъект.Дата);
	Запрос.УстановитьПараметр("Номенклатура", ТекущийОбъект.Товары.ВыгрузитьКолонку("Номенклатура"));
	
	РезультатЗапроса = Запрос.Выполнить();

	ТЗ = РезультатЗапроса.Выгрузить();
	
	Строки = ТЗ.НайтиСтроки(Новый Структура("Этап", Перечисления.ЭтапыИзмененияАссортимента.ПереносВАрхивОтзыв));
	Если Строки.Количество() > 0 Тогда
		Сообщить("Управление ассортиментом. Перенос в архив / отзыв (запрещены закупки и продажи)");
		Для каждого Т Из Строки Цикл
			Сообщить(Т.Номенклатура);
		КонецЦикла;
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Строки = ТЗ.НайтиСтроки(Новый Структура("Этап", Перечисления.ЭтапыИзмененияАссортимента.ВводВАссортиментСОтсрочкойНачалаПродаж));
	Если Строки.Количество() > 0 Тогда
		Сообщить("Управление ассортиментом. Ввод в ассортимент с отсрочкой начала продаж (разрешены только закупки)");
		Для каждого Т Из Строки Цикл
			Сообщить(Т.Номенклатура);
		КонецЦикла;
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Строки = ТЗ.НайтиСтроки(Новый Структура("Этап", Перечисления.ЭтапыИзмененияАссортимента.ВыводИзАссортимента));
	Если Строки.Количество() > 0 Тогда
		
		ТЗ_Остатки = ОстатокТовара(ТекущийОбъект.Товары.ВыгрузитьКолонку("Номенклатура"), ТекущийОбъект.Дата);
		
		Для каждого Т Из Строки Цикл
			КоличествоДокумента = 0;
			СтрокиДокумента = ТекущийОбъект.Товары.НайтиСтроки(Новый Структура("Номенклатура", Т.Номенклатура));
			Для каждого СтрокаДокумента Из СтрокиДокумента Цикл
				КоличествоДокумента = КоличествоДокумента + СтрокаДокумента.КоличествоУпаковок;
			КонецЦикла;
			
			СтрокиОстатка = ТЗ_Остатки.НайтиСтроки(Новый Структура("Номенклатура", Т.Номенклатура));
			Если СтрокиОстатка.Количество() = 0 Тогда
				Сообщить("Управление ассортиментом. Вывод ассортимента");
				Сообщить("" + Т.Номенклатура + " требуется: " + КоличествоДокумента + " остаток: -");
				Отказ = Истина;
			Иначе
				Остаток = СтрокиОстатка[0].Остаток;
				Если Остаток < КоличествоДокумента Тогда
					Сообщить("Управление ассортиментом. Вывод ассортимента");
					Сообщить("" + Т.Номенклатура + " требуется: " + КоличествоДокумента + " остаток: " + Остаток);
					Отказ = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;

	КонецЕсли;


КонецПроцедуры

// новый алгоритм
Процедура УправлениеАссортиментом(Отказ, ТекущийОбъект, ПараметрыЗаписи) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	Если ТипЗнч(ТекущийОбъект) = Тип("ДокументОбъект.ЗаказКлиента") Тогда

		Для каждого Т Из ТекущийОбъект.Товары Цикл
			
			РольЭтап = РольЭтап(Т.Номенклатура, ТекущийОбъект.Дата);
			Если ПустаяСтрока(РольЭтап.Этап) Тогда
				Продолжить;
			КонецЕсли;
			
			Если РольЭтап.Этап = Перечисления.ЭтапыИзмененияАссортимента.ПереносВАрхивОтзыв Тогда
				Сообщить("Строка: " + Т.НомерСтроки + ", " + Т.Номенклатура + " - ассортимент: перенос в архив/отзыв");
				Отказ = Истина;
				Прервать;
			ИначеЕсли РольЭтап.Этап = Перечисления.ЭтапыИзмененияАссортимента.ВводВАссортимент Тогда
				// все разрешено
			ИначеЕсли РольЭтап.Этап = Перечисления.ЭтапыИзмененияАссортимента.ВводВАссортиментСОтсрочкойНачалаПродаж Тогда
				Сообщить("Строка: " + Т.НомерСтроки + ", " + Т.Номенклатура + " - ассортимент: ввод с отсрочкой начала продаж");
				Отказ = Истина;
				Прервать;
			ИначеЕсли РольЭтап.Этап = Перечисления.ЭтапыИзмененияАссортимента.ИзменениеСостоянияАссортимента Тогда
				// все разрешено
			ИначеЕсли РольЭтап.Этап = Перечисления.ЭтапыИзмененияАссортимента.ВыводИзАссортимента Тогда
				// все разрешено
			КонецЕсли;
			
		КонецЦикла;
	
	ИначеЕсли ТипЗнч(ТекущийОбъект) = Тип("ДокументОбъект.ЗаказПоставщику") Тогда
		
		Для каждого Т Из ТекущийОбъект.Товары Цикл

			РольЭтап = РольЭтап(Т.Номенклатура, ТекущийОбъект.Дата);
			Если ПустаяСтрока(РольЭтап.Этап) Тогда
				Продолжить;
			КонецЕсли;
			
			Если РольЭтап.Этап = Перечисления.ЭтапыИзмененияАссортимента.ПереносВАрхивОтзыв Тогда
				Сообщить("Строка: " + Т.НомерСтроки + ", " + Т.Номенклатура + " - ассортимент: перенос в архив/отзыв");
				Отказ = Истина;
				Прервать;
			ИначеЕсли РольЭтап.Этап = Перечисления.ЭтапыИзмененияАссортимента.ВводВАссортимент Тогда
				// все разрешено
			ИначеЕсли РольЭтап.Этап = Перечисления.ЭтапыИзмененияАссортимента.ВводВАссортиментСОтсрочкойНачалаПродаж Тогда
				// все разрешено
			ИначеЕсли РольЭтап.Этап = Перечисления.ЭтапыИзмененияАссортимента.ИзменениеСостоянияАссортимента Тогда
				// все разрешено
			ИначеЕсли РольЭтап.Этап = Перечисления.ЭтапыИзмененияАссортимента.ВыводИзАссортимента Тогда
				Сообщить("Строка: " + Т.НомерСтроки + ", " + Т.Номенклатура + " - ассортимент: вывод");
				Отказ = Истина;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;

	КонецЕсли;

КонецПроцедуры

#КонецОбласти
